bbt_api/app/controllers/graph_controller.rb

SELECT "transactions".* FROM "transactions"
SELECT "inventories".* FROM "inventories" WHERE (drink_id = '1')
SELECT "stores".* FROM "stores" WHERE (location = 'Burnaby')
SELECT "inventories".* FROM "inventories" INNER JOIN "transactions" ON "transactions"."inventory_id" = "inventories"."id" WHERE "inventories"."store_id" = $1 AND (drink_id = '1')  [["store_id", 3]]
---
  def index

   totalBBTsale = Transaction.all.length
   totalTarosale = Inventory.where("drink_id = '1'").length + Inventory.where("drink_id = '3'").length
   totalLychesale = Inventory.where("drink_id = '2'").length + Inventory.where("drink_id = '4'").length
   totalStrBurnaby =  Store.where("location = 'Burnaby'").length
   totalStrRichmond =  Store.where("location = 'Richmond'").length
   storeTransaction = @store.inventories.joins(:transactions).length

SELECT  "stores".* FROM "stores" WHERE "stores"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def find_store
    @store = Store.find(params[:store_id])