bbt_api/app/controllers/login_controller.rb

  def token

    user = User.find_by(email: params[:username])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "abc@abc.com"], ["LIMIT", 1]]