bbt_api/app/controllers/login_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "1312424214"], ["LIMIT", 1]]
---
  def token

    user = User.find_by(username: params[:username])