bbt_api/app/controllers/orders_controller.rb

	def show
		# todo: look shit up in DB, return as JSON
		@orders = Order.where(store_id: params[:id])
---
SELECT "orders".* FROM "orders" WHERE "orders"."store_id" = $1  [["store_id", 1]]

	def create
		@order = params[:order]
    @user = params[:user]
    @store = params[:store]
    # @store = params[:]
		@orderdata = Order.new(order: @order, user_id: @user, store_id: @store)
		@orderdata.save;
---
INSERT INTO "orders" ("order", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["order", "{\"Poo Slush\",\"Tuna Egg Slush\",\"Salmon Slush\"}"], ["user_id", 1], ["created_at", "2017-09-16 21:11:12.410908"], ["updated_at", "2017-09-16 21:11:12.410908"]]