bbt_api/app/controllers/points_controller.rb

  def index
    user = User.find(params[:user_id])
    trans = user.transactions
    sumPoint = trans.sum(:transpoint)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
SELECT "transactions".* FROM "transactions" WHERE "transactions"."user_id" = $1  [["user_id", 1]]
SELECT SUM("transactions"."transpoint") FROM "transactions" WHERE "transactions"."user_id" = $1  [["user_id", 1]]