bbt_api/app/controllers/stores_controller.rb

  def show
    stores = Store.all
---
SELECT "stores".* FROM "stores"