bbt_api/app/controllers/stores_controller.rb

  def show
    store = Store.find(params[:id])
---
SELECT  "stores".* FROM "stores" WHERE "stores"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]