bbt_api/app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def show
    user = User.find(params[:id]).as_json ##FIX TO:  User.find_by_id(params[:id]) ALSO users become user

INSERT INTO "users" ("name", "password_digest", "email", "username") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Wing"], ["password_digest", "$2a$10$udYcqc/vnbBMKqQNx7jlJeTpeJ56RNgzk7fSm9qkFcLLVlKa2JrzO"], ["email", "2@2.com"], ["username", "Winky"]]
---
  def create
    @user = User.new(user_params)
    @user.save;